In [1]:
import pandas as pd

In [2]:
JOB = pd.read_csv('lv2-2508.csv')

In [3]:
JOB.shape

(6000, 6)

In [4]:
JOB.head()

   E_ID JOB_CATEGORY  SALARY EXP_LEVEL WORK_SETTING COMP_SIZE
0     1            B  174350    Senior       Remote         M
1     2            B  155000    Senior     Inperson         M
2     3            B  120500    Senior       Remote         M
3     4            A  258000    Senior     Inperson         M
4     5            G  280100    Senior       Remote         M

# Q21

# Step 21-1

In [5]:
DF11 = JOB[JOB['JOB_CATEGORY'] == 'A']

In [6]:
DF11.shape

(2008, 6)

# Step 21-2

In [7]:
DF11.head()

    E_ID JOB_CATEGORY  SALARY EXP_LEVEL WORK_SETTING COMP_SIZE
3      4            A  258000    Senior     Inperson         M
9     10            A  187259    Senior     Inperson         M
12    13            A  297300    Senior       Remote         M
19    20            A  100000    Senior     Inperson         M
21    22            A  130000    Senior       Remote         M

In [8]:
SAL_Q1 = DF11['SALARY'].quantile(q=0.25)
SAL_Q3 = DF11['SALARY'].quantile(q=0.75)

In [9]:
SAL_Q1, SAL_Q3

(np.float64(136000.0), np.float64(210000.0))

# Step 21-3

In [10]:
DF12 = DF11.pivot_table(index=['EXP_LEVEL', 'WORK_SETTING', 'COMP_SIZE'], values=['E_ID', 'SALARY'], aggfunc=['count', 'mean']).reset_index()

In [11]:
DF12.head()

    EXP_LEVEL WORK_SETTING COMP_SIZE count                mean
                                      E_ID SALARY         E_ID         SALARY
0  Entrylevel     Inperson         L     7      7  2363.714286  157734.285714
1  Entrylevel     Inperson         M    51     51  3391.039216  131638.019608
2  Entrylevel       Remote         M    20     20  3015.500000  115269.800000
3   Executive     Inperson         L     2      2  4966.500000  206250.000000
4   Executive     Inperson         M    29     29  3064.827586  221239.655172

In [12]:
DF12.columns=['EXP_LEVEL', 'WORK_SETTING', 'COMP_SIZE', 'E_CNT', '_1', '_2', 'SAL_AVG']

In [13]:
DF12.head()

    EXP_LEVEL WORK_SETTING COMP_SIZE  E_CNT  _1           _2        SAL_AVG
0  Entrylevel     Inperson         L      7   7  2363.714286  157734.285714
1  Entrylevel     Inperson         M     51  51  3391.039216  131638.019608
2  Entrylevel       Remote         M     20  20  3015.500000  115269.800000
3   Executive     Inperson         L      2   2  4966.500000  206250.000000
4   Executive     Inperson         M     29  29  3064.827586  221239.655172

In [14]:
DF12 = DF12.drop(columns=['_1', '_2'])

In [15]:
DF12.head()

    EXP_LEVEL WORK_SETTING COMP_SIZE  E_CNT        SAL_AVG
0  Entrylevel     Inperson         L      7  157734.285714
1  Entrylevel     Inperson         M     51  131638.019608
2  Entrylevel       Remote         M     20  115269.800000
3   Executive     Inperson         L      2  206250.000000
4   Executive     Inperson         M     29  221239.655172

# 21-4

In [16]:
DF_HIGH = DF12[DF12['SAL_AVG'] >= SAL_Q3]

In [17]:
DF_LOW = DF12[DF12['SAL_AVG'] <= SAL_Q1]

In [18]:
DF_HIGH.shape

(1, 5)

In [19]:
DF_LOW.shape

(2, 5)

In [20]:
DF_HIGH.head()

   EXP_LEVEL WORK_SETTING COMP_SIZE  E_CNT        SAL_AVG
4  Executive     Inperson         M     29  221239.655172

In [21]:
DF_LOW.head()

    EXP_LEVEL WORK_SETTING COMP_SIZE  E_CNT        SAL_AVG
1  Entrylevel     Inperson         M     51  131638.019608
2  Entrylevel       Remote         M     20  115269.800000

In [22]:
high_res = (29 * 221239.655172) / 29
low_res = (51 * 131638.019608 + 20 * 115269.800000) / (51 + 20)

# Q21 Answer

In [23]:
round(abs(high_res - low_res), 1)

94212.4

# Q22

In [24]:
df_22 = JOB.copy()

In [25]:
df_22.shape

(6000, 6)

In [26]:
df_22.head()

   E_ID JOB_CATEGORY  SALARY EXP_LEVEL WORK_SETTING COMP_SIZE
0     1            B  174350    Senior       Remote         M
1     2            B  155000    Senior     Inperson         M
2     3            B  120500    Senior       Remote         M
3     4            A  258000    Senior     Inperson         M
4     5            G  280100    Senior       Remote         M

In [27]:
df_22['EXP_LEVEL'].value_counts()

EXP_LEVEL
Senior        4621
Midlevel       978
Entrylevel     213
Executive      188
Name: count, dtype: int64

# Step 22-1

In [28]:
exps = []

for exp in df_22['EXP_LEVEL']:
    if (exp == 'Entrylevel') | (exp == 'Midlevel'):
        exps.append('L')
    else:
        exps.append('H')

In [29]:
df_22['EXP'] = exps

In [30]:
df_22.head()

   E_ID JOB_CATEGORY  SALARY EXP_LEVEL WORK_SETTING COMP_SIZE EXP
0     1            B  174350    Senior       Remote         M   H
1     2            B  155000    Senior     Inperson         M   H
2     3            B  120500    Senior       Remote         M   H
3     4            A  258000    Senior     Inperson         M   H
4     5            G  280100    Senior       Remote         M   H

# Step 22-2

In [31]:
cats = ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [37]:
res = []

for cat in cats:
    df = df_22[df_22['JOB_CATEGORY'] == cat]
    df_h = df[df['EXP'] == 'H']
    df_l = df[df['EXP'] == 'L']

    res.append((abs(df_h['SALARY'].mean() - df_l['SALARY'].mean())) / (((len(df_h) * df_h['SALARY'].std()) + (len(df_l) * df_l['SALARY'].std())) / (len(df_h) + len(df_l))))

In [38]:
len(res)

7

In [39]:
res

[np.float64(0.6069808512067583),
 np.float64(0.6752817089903216),
 np.float64(0.5995347290550024),
 np.float64(0.6830553715961155),
 np.float64(0.912459570513902),
 np.float64(0.8176841265367327),
 np.float64(0.5829608829209109)]

# Step 22-3

In [41]:
A2 = max(res)
B2 = min(res)

# Q22 Answer

In [42]:
round(abs(A2 - B2), 3)

np.float64(0.329)

# Q23

In [55]:
df_23 = JOB.copy()

In [56]:
df_23.shape

(6000, 6)

In [57]:
df_23.head()

   E_ID JOB_CATEGORY  SALARY EXP_LEVEL WORK_SETTING COMP_SIZE
0     1            B  174350    Senior       Remote         M
1     2            B  155000    Senior     Inperson         M
2     3            B  120500    Senior       Remote         M
3     4            A  258000    Senior     Inperson         M
4     5            G  280100    Senior       Remote         M

# Step 23-1

In [58]:
targets = ['JOB_CATEGORY', 'EXP_LEVEL', 'WORK_SETTING', 'COMP_SIZE']

In [59]:
df_23 = pd.get_dummies(data=df_23, drop_first=True, columns=targets, dtype='int')

In [60]:
df_23.head()

,E_ID,SALARY,JOB_CATEGORY_B,JOB_CATEGORY_C,JOB_CATEGORY_D,JOB_CATEGORY_E,JOB_CATEGORY_F,JOB_CATEGORY_G,EXP_LEVEL_Executive,EXP_LEVEL_Midlevel,EXP_LEVEL_Senior,WORK_SETTING_Remote,COMP_SIZE_M
0,1,174350,1,0,0,0,0,0,0,0,1,1,1
1,2,155000,1,0,0,0,0,0,0,0,1,0,1
2,3,120500,1,0,0,0,0,0,0,0,1,1,1
3,4,258000,0,0,0,0,0,0,0,0,1,0,1
4,5,280100,0,0,0,0,0,1,0,0,1,1,1

# Step 23-2

In [61]:
TRAIN30 = df_23[df_23['E_ID'] % 5 != 0]
TEST30 = df_23[df_23['E_ID'] % 5 == 0]

In [62]:
TRAIN30.shape

(4800, 13)

In [63]:
TEST30.shape

(1200, 13)

# Step 23-3

In [65]:
q1 = TRAIN30['SALARY'].quantile(q=0.25)
q3 = TRAIN30['SALARY'].quantile(q=0.75)
iqr = q3 - q1

TRAIN31 = TRAIN30[(TRAIN30['SALARY'] >= q1 - 1.5 * iqr) & (TRAIN30['SALARY'] <= q3 + 1.5 * iqr)]
TRAIN31.shape

(4729, 13)

# Step 23-4

In [66]:
TRAIN31.head()

,E_ID,SALARY,JOB_CATEGORY_B,JOB_CATEGORY_C,JOB_CATEGORY_D,JOB_CATEGORY_E,JOB_CATEGORY_F,JOB_CATEGORY_G,EXP_LEVEL_Executive,EXP_LEVEL_Midlevel,EXP_LEVEL_Senior,WORK_SETTING_Remote,COMP_SIZE_M
0,1,174350,1,0,0,0,0,0,0,0,1,1,1
1,2,155000,1,0,0,0,0,0,0,0,1,0,1
2,3,120500,1,0,0,0,0,0,0,0,1,1,1
3,4,258000,0,0,0,0,0,0,0,0,1,0,1
5,6,110000,0,0,1,0,0,0,0,1,0,1,1

In [67]:
TRAIN31.shape

(4729, 13)

In [68]:
from sklearn.tree import DecisionTreeRegressor

In [75]:
model = DecisionTreeRegressor(max_depth=4, min_samples_split=100, random_state=1234).fit(X=TRAIN31.iloc[:, -11:], y=TRAIN31['SALARY'])

# Step 23-5

In [76]:
pred = model.predict(X=TEST30.iloc[:, -11:])

In [77]:
from sklearn.metrics import mean_squared_error

In [78]:
mse = mean_squared_error(y_true=TEST30['SALARY'], y_pred=pred)

In [79]:
mse

3048456800.6064224

# Q23 Answer

In [81]:
print(round(mse ** 0.5 , 2))

55212.83